w1=0.2
w2=0.2
w3=0.3
a1=-0.008395
a2= 0.009787
a3=
b1=17.37583
b2=-0.246842
b3=
e1=
e2=
e3=
y11= %24年预测义务教育在校人数
y12= %25年预测义务教育在校人数
y13= %26年预测义务教育在校人数
y21= %24年预测高中在校人数
y22= %25年预测高中在校人数
y23= %26年预测高中在校人数
y31= %24年预测大学在校人数
y32= %25年预测大学在校人数
y33= %26年预测大学在校人数
Q1l= %Q1t下界
Q1u= %Q1t上界
Q2l= %Q2t下界
Q2u= %Q2t上界
Q3l= %Q3t下界
Q3u= %Q3t上界
B1=
B2=
B3=
f=[-w1*a1,-w2*a2,-w3*a3]
A=[-1,0,0;
    0,-1,0;
    0,0,-1;
    a1,0,0;
    0,a2,0;
    0,0,a3;
    -a1,0,0;
    0,-a2,0;
    0,0,-a3;
    1,1,1]
l1=[-e1*y11,-e2*y21,-e3*y31,Q1u-b11,Q2u-b21,Q3u-b31,-Q1l+b11,-Q2l+b21,-Q3l+b31,B1]
l2=[-e1*y12,-e2*y22,-e3*y32,Q1u-b12,Q2u-b22,Q3u-b32,-Q1l+b12,-Q2l+b22,-Q3l+b32,B2]
l3=[-e1*y13,-e2*y23,-e3*y33,Q1u-b13,Q2u-b23,Q3u-b33,-Q1l+b13,-Q2l+b23,-Q3l+b33,B3]
x1=linprog(f,A,l1)
x2=linprog(f,A,l2)
x3=linprog(f,A,l3)